app/controllers/artists_controller.rb

  def show

    if Artist.where(id: params[:id]).exists?
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]